<div style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=5>
		<font color=#43a8a5 size=6>
			<br />
			<div align=center>
کتاب‌خانه pandas
            </div>
		</font>
		<br />
		<hr />
		<style type="text/css" scoped>
        p{
        border: 1px solid #a2a9b1;background-color: #f8f9fa;display: inline-block;
        };
        </style>
		<div>
			<h3>فهرست مطالب</h3>
			<ul style="margin-right: 0;">
				<li>
                    <a href="#sec_intro">
                        مقدمات
                    </a>
                </li>
                <li>
					<a href="#sec_definition">
                        تعریف DataFrame
                    </a>
				</li>
                <li>
					<a href="#sec_operation">
                      عملیات‌های مقدماتی
                    </a>
				</li>
                <li>
					<a href="#sec_selection">
                        انتخاب داده
                    </a>
				</li>
                <li>
					<a href="#sec_file">
                        خواندن فایل
                    </a>
				</li>
                <li>
					<a href="#sec_summary">
                       خلاصه‌سازی داده
                    </a>
				</li>
                <li>
					<a href="#sec_groupby">
                       گروه‌بندی داده‌ها
                    </a>
				</li>
                <li>
					<a href="#sec_add_remove">
                       اضافه‌کردن و حذف ستون
                    </a>
				</li>
                <li>
					<a href="#sec_additional">
                       مطالعه بیشتر
                    </a>
				</li>
			</ul>
		</div>
	</font>
</div>

<br>
<div id="sec_intro" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
            مقدمات
        </font>
		<p></p>
		<hr>
        کتاب‌خانه <a href="https://pandas.pydata.org/">pandas</a>(پانْداز)، کتاب‌خانه‌ای متن‌باز در پایتون است که داده‌ساختارها و ابزارهای لازم برای کار با داده‌ها و تحلیل آن‌ها را فراهم می‌کند.
<br>
در این درس‌نامه با مقدمات کار با pandas آشنا می‌شویم.
<br>
برای شروع، ابتدا کتاب‌خانه pandas را نصب می‌کنیم:
</font>
</div>

In [ ]:
!pip install pandas

<div style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
سپس کتاب‌خانه را وارد محیط‌ کار می‌کنیم:


   </font>
</div>

In [28]:
import pandas as pd

<br>
<div id="sec_definition" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
        تعریف DataFrame
        </font>
        <p></p>
		<hr>
داده‌ساختار اصلی pandas که در طول این دوره از آن استفاده می‌کنیم، DataFrame نام دارد. DataFrame ، داده‌ساختاری دوبعدی(شبیه جدول) است که از آن برای نگهداری و کار با داده‌ها استفاده می‌کنیم. برای تعریف DataFrame ، می‌توانیم از دستور زیر استفاده کنیم:  
  </font>
</div>

In [29]:
data = {'Name':['Ata','Mostafa','Negin','Mahdi'],
        'Age':[34,17,19,22],
        'Gender':['Male','Male','Female','Male']    
}

In [30]:
df = pd.DataFrame(data)

In [31]:
df

      Name  Age  Gender
0      Ata   34    Male
1  Mostafa   17    Male
2    Negin   19  Female
3    Mahdi   22    Male

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        همان‌طور که دیدید، ابتدا یک دیکشنری به نام data تعریف می‌کنیم. سپس data را به عنوان ورودی <code>pd.DataFrame</code> می‌دهیم. DataFrame ساخته‌شده، سه ستون به نام‌های Age، Name و Gender دارید و چهار سطر.
   </font>
</div>

<br>
<div id="sec_operation" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
        عملیات‌های مقدماتی
        </font>
		<p></p>
		<hr>
        دیدن چند سطر اول یا آخر از داده، می‌تواند دید کلی خوبی از داده‌ها بدهد.(به خصوص برای داده‌های بزرگ که قابل نمایش نیستند.) با دستورهای <code>head</code> و <code>tail</code> می‌توانیم این کار را انجام دهیم.
	</font>
</div>

In [32]:
df.head(2)

      Name  Age Gender
0      Ata   34   Male
1  Mostafa   17   Male

In [33]:
df.tail(3)

      Name  Age  Gender
1  Mostafa   17    Male
2    Negin   19  Female
3    Mahdi   22    Male

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
در دستور اول، دو سطر اول DataFrame نشان داده می‌شود و در دستور دوم سه سطر آخر. اگر عدد تعداد سطر را مشخص نکنیم، به صورت پیش‌فرض پنج سطر اول یا آخر نشان داده می‌شود
<br>
وقتی که داده‌ای را می‌خوانیم، تمایل داریم تا بتوانیم شهودی کلی از داده به دست بیاوریم. دستور <code>describe</code> آماره‌های مهم را برای ستون‌های عددی حساب می‌کند و کمک خوبی به فهم کلیات داده می‌کند.    </font>
</div>

In [34]:
df.describe()

             Age
count   4.000000
mean   23.000000
std     7.615773
min    17.000000
25%    18.500000
50%    20.500000
75%    25.000000
max    34.000000

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
        همان‌طور که در بالا می‌بینیم، فراوانی، میانگین، انحراف معیار، کمینه، چارک اول، میانه، چارک سوم و بیشینه ستون Age که تنها ستون عددی DataFrame است، نمایش داده می‌شود.
<br>
        دستور <code>describe</code> تنها برای ستون‌های عددی به کار می‌رود. اگر بخواهیم آماره‌ها برای ستون‌های دیگر هم حساب شوند، می‌توانید پارامتر <code>include</code> تابع را برابر <code>'all'</code> قرار دهیم.
</font>
</div>

In [35]:
df.describe(include = 'all')

         Name        Age Gender
count       4   4.000000      4
unique      4        NaN      2
top     Negin        NaN   Male
freq        1        NaN      3
mean      NaN  23.000000    NaN
std       NaN   7.615773    NaN
min       NaN  17.000000    NaN
25%       NaN  18.500000    NaN
50%       NaN  20.500000    NaN
75%       NaN  25.000000    NaN
max       NaN  34.000000    NaN

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
البته برخی آماره‌های عددی برای ستون‌های غیر عددی قابل محاسبه نیستند؛ لذا به جای آن‌ها مقدار 
        <code>NaN</code> 
        (Not a Number)
        گذاشته شده است.
<br>
گاهی لازم است مقادیر DataFrame بر اساس مقادیر یکی از ستون‌ها مرتب‌سازی شوند. برای این کار می‌توانیم از دستور <code>sort_values</code> استفاده کنیم.
</font>
</div>

In [36]:
df.sort_values('Name')

      Name  Age  Gender
0      Ata   34    Male
3    Mahdi   22    Male
1  Mostafa   17    Male
2    Negin   19  Female

In [37]:
df.sort_values('Age',ascending = False)

      Name  Age  Gender
0      Ata   34    Male
3    Mahdi   22    Male
2    Negin   19  Female
1  Mostafa   17    Male

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
دستور اول، داده‌ها را بر اساس ستون Name ، به صورت صعودی مرتب می‌کند. همان‌طور که در دستور دوم می‌بینیم، اگر بخواهیم مرتب‌سازی نزولی باشد، می‌توانیم پارامتر <code>ascending</code> را برابر <code>False</code> قرار دهیم.


</font>
</div>

<br>
<div id="sec_selection" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
انتخاب داده
        </font>
		<p></p>
		<hr>
در این بخش درباره انتخاب‌ کردن بخش‌های داده صحبت می‌کنیم.



</font>
</div>

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
        <b>
            انتخاب ستون
        </b>
        <br>
برای انتخاب ستون خاصی از داده، دو راه داریم:



</font>
</div>

In [38]:
df.Age

0    34
1    17
2    19
3    22
Name: Age, dtype: int64

In [39]:
df['Age']

0    34
1    17
2    19
3    22
Name: Age, dtype: int64

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
همان‌طور که دیدید، برای انتخاب ستون Age، از دو طریق اقدام کردیم که هر دو راه نتیجه‌ای مشابه داشت.
<br>
برای انتخاب بیشتر از یک ستون، می‌توانیم از شیوه زیر پیروی کنیم:
</div>

In [40]:
df[['Name','Gender']]

      Name  Gender
0      Ata    Male
1  Mostafa    Male
2    Negin  Female
3    Mahdi    Male

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
        <b>
            انتخاب ردیف
        </b>
        <br>
برای انتخاب ردیف‌های داده، روش‌های مختلفی داریم که شباهت زیادی به همین کار در numpy دارند.




</font>
</div>

In [41]:
df[1:3]

      Name  Age  Gender
1  Mostafa   17    Male
2    Negin   19  Female

In [42]:
df.loc[1:3]

      Name  Age  Gender
1  Mostafa   17    Male
2    Negin   19  Female
3    Mahdi   22    Male

In [43]:
df[df.Age > 20]

    Name  Age Gender
0    Ata   34   Male
3  Mahdi   22   Male

In [44]:
df[(df.Name == 'Ata') | (df.Age < 21)]

      Name  Age  Gender
0      Ata   34    Male
1  Mostafa   17    Male
2    Negin   19  Female

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
دستور اول، سطرهای یک تا سه(بدون احتساب سه) داده را برمی‌گرداند.
<br>
دستور دوم، سطرهای یک تا سه(با احتساب سه) داده را برمی‌گرداند.
<br>
دستور سوم، سطرهایی را که Age آن‌ها بیشتر از بیست است، برمی‌گرداند.
<br>
دستور چهارم هم سطرهایی را برمی‌گرداند که یا اسم‌شان برابر Ata است یا سن‌شان کمتر از بیست و یک.

</font>
</div>

<br>
<div id="sec_R_packages" style="direction:rtl;line-height:300%;">
    <font face="XB Zar" size=4>
        <b>
انتخاب ردیف و ستون
        </b>
        <br>
برای برش‌ زدن بخشی از DataFrame، یعنی انتخاب بلوکی از سطرها و ستون‌ها، می‌توانیم به روش‌های مختلفی اقدام کنیم. مثلا فرض کنید می‌خواهیم سن و نام آقایان را به عنوان خروجی بگیریم.



</font>
</div>

In [45]:
df[df.Gender == 'Male'][['Name','Age']]

      Name  Age
0      Ata   34
1  Mostafa   17
3    Mahdi   22

In [46]:
df.loc[df.Gender == 'Male',['Name','Age']]

      Name  Age
0      Ata   34
1  Mostafa   17
3    Mahdi   22

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
        دستور <code>loc</code>، برای انتخاب سطر و ستون(بر اساس نام ستون) به کار می‌رود. برای انتخاب بر اساس شماره ستون می‌توانید از دستور <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html"><code>iloc</code></a> استفاده کنید.


</font>
</div>

<br>
<div id="sec_file" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
خواندن فایل
        </font>
		<p></p>
		<hr>
آن‌چه که در این درس‌نامه دیدیم، مقدمه‌ای بر قابلیت‌ها و دستورات pandas در کارکردن با داده‌های واقعی، اکثر مواقع داده‌ها را باید از روی فایل بخوانیم و گاهی نیز نیاز است داده پردازش‌شده را روی فایلی ذخیره کنیم. به همین دلیل، در این بخش نگاهی به توابع کار با فایل pandas خواهیم داشت.


</font>
</div>

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
        <b>        
            فایل CSV
        </b>
        <br>
یکی از متداول‌ترین قالب‌های ذخیره داده‌ها، CSV است. <a href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a> مخفف عبارت Comma-separated Values به معنای «مقادیر جداشده با ویرگول» است. این نام‌گذاری به این دلیل است که نوعا مقادیر در فایل‌های CSV با ویرگول از هم‌دیگر جدا می‌شوند.(برای دیدن شیوه نوشته‌شدن این فایل‌ها می‌توانید یک فایل CSV را با یک نرم‌افزار ویرایش‌گر متن مثل notepad باز کنید.)
<br>
گاهی اوقات به جای ویرگول، از علایم دیگری برای جداکردن مقادیر از هم استفاده می‌شود. به عنوان نمونه می‌توانید فایل CSV شاخص کیفیت هوای آمریکا در سال ۲۰۱۸ را از 
    <a href="https://quera.ir/qbox/download/XYFrRTpuiE/AQI2018.csv">        اینجا</a>
دانلود کنید.(
<a href="https://aqs.epa.gov/aqsweb/airdata/download_files.html">        منبع</a>
        ) با این داده در ادامه کار خواهیم کرد.

<br>
<b>
خواندن فایل CSV
</b>

<br>
برای خواندن فایل CSV و ریختن آن در یک DataFrame می‌توانیم از دستور <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html"><code>read_csv</code></a> استفاده کنیم.

</font>
</div>

In [47]:
aqi_data = pd.read_csv('AQI2018.csv',sep = ',')

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
        پارامتر اصلی این تابع، آدرس فایل مورد نظر است. یکی از پارامترهای اختیاری این تابع <code>sep</code> است که مخفف seperator به معنای جداکننده است. این پارامتر تعیین می‌کند چه کاراکتری به عنوان جداکننده مقادیر استفاده می‌شود. مقدار پیش‌فرض این تابع ویرگول(,) است.(در مثال بالا بودن و نبودن پارامتر <code>sep</code> تفاوتی ندارد چون کاراکتر جداکننده این فایل ویرگول است.)
<br>
برای این‌که نسبت به داده بیشتر شهود پیدا کنیم، چند سطر اول آن را می‌بینیم:

</font>
</div>

In [48]:
aqi_data.head()

  State Name county Name        Date  AQI Category Defining Parameter
0    Alabama     Baldwin  2018-01-02   32     Good              PM2.5
1    Alabama     Baldwin  2018-01-05   34     Good              PM2.5
2    Alabama     Baldwin  2018-01-08   15     Good              PM2.5
3    Alabama     Baldwin  2018-01-11   19     Good              PM2.5
4    Alabama     Baldwin  2018-01-14   25     Good              PM2.5

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
        این داده‌، اطلاعات مربوط به شاخص کیفیت هوای(<a href="https://en.wikipedia.org/wiki/Air_quality_index">AQI</a>) آمریکا در سال ۲۰۱۸ است که در آن شاخص کیفیت هوا برای هر بخش آمریکا در هر روز از سال ۲۰۱۸ ذکر شده. داده شش ستون دارد که هر کدام را شرح می‌دهیم:

<ul style="margin-right: 0;">
				<li>
نام ایالت(State Name)
                </li>
                <li>
نام بخش(county Name): هر ایالت چندین بخش(شهرستان) دارد.
</li>

<li>
تاریخ(Date)
</li>

<li>
شاخص کیفیت هوا(AQI)
</li>

<li>
سطح آلودگی(Category): عنوانی که تابعی از شاخص کیفیت هواست.
</li>

<li>
آلاینده(Defining Parameter)
</li>

</ul>

<b>
نوشتن فایل CSV
</b>
<br>
برای ذخیره یک DataFrame با فرمت CSV می‌توانیم از دستور <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html"><code>to_csv</code></a> استفاده کنیم.

</font>
</div>

In [49]:
df.to_csv('data.csv',index = False)

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
پارامتر اول این تابع، مکان ذخیره فایل است. پارامتر index پارامتری اختیاری است که تعیین می‌کند آیا شماره سطرها را نیز ذخیره کنیم یا نه. مقدار پیش‌فرض این مقدار <code>True</code> است؛ به این معنا که شماره سطرها را نیز ذخیره می‌کند.

<br>
<b>
سایر قالب‌های فایل
</b>
<br>
کتاب‌خانه pandas ، برای خواندن و نوشتن سایر قالب‌ها نیز توابعی دارد که از این 
<a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html">پیوند</a>
می‌توانید مفصل با آن‌ها اشنا شوید.

</font>
</div>

<br>
<div id="sec_summary" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
خلاصه‌سازی داده
        </font>
		<p></p>
		<hr>
کتاب‌خانه pandas ، توابعی نیز برای خلاصه‌سازی داده و محاسبه آماره‌ها دارد.
<br>
در مثال‌های زیر می‌بینیم که برای خلاصه‌سازی کل ستون‌ها یا یک ستون خاص، چه می‌توان کرد.
</font>
</div>

In [50]:
df.mean()

Age    23.0
dtype: float64

In [51]:
aqi_data.AQI.median()

37.0

In [52]:
df.Age.std()

7.615773105863909

In [53]:
df.Age.var()

58.0

In [54]:
df.Age.sum()

92

In [55]:
aqi_data.AQI.max()

996

In [56]:
aqi_data.AQI.min()

0

In [57]:
aqi_data.AQI.quantile(0.25)

27.0

In [58]:
aqi_data['State Name'].nunique()

54

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        <br>
        دستوراول، میانگین ستون‌های عددی داده را حساب می‌کند.
<br>
دستور دوم، میانه ستون AQI از داده aqi_data را حساب می‌کند.
<br>
دستور سوم و چهارم، به ترتیب انحراف معیار و واریانس ستون Age را حساب می‌کند.
<br>
دستور پنجم مجموع ستون Age را حساب می‌کند.
<br>
دستور ششم و هفتم، به ترتیب بیشینه و کمینه ستون AQI را حساب می‌کند.
<br>
        دسور هشتم، چارک اول ستون AQI را حساب می‌کند. دستور <code>quantile</code> برای محاسبه 
    <a href="https://en.wikipedia.org/wiki/Quantile">        چندک</a>
داده‌ها به کار می‌رود. در این مثال، پارامتر اول برابر 0.25 قرار داده شده؛ برای همین چارک اول برگردانده می‌شود.
<br>
دستور نهم، تعداد مقادیر مختلف ستون State Name را برمی‌گرداند.
<br>
اگر این دستورات روی کل DataFrame صدا کنیم، دستور روی تمام ستون‌هایی که امکان اجرا دارد، اجرا می‌شود.
<br>
</font>
</div>

<br>
<div id="sec_groupby" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
گروه‌بندی داده‌ها
        </font>
		<p></p>
		<hr>
        در تحلیل داده‌ها، خیلی اوقات نیاز است تا داده‌ها را بر اساس یک یا چند به گروه‌های مختلف تقسیم کنیم و روی هر گروه، محاسباتی انجام دهیم.
<br>
مثلا فرض کنید می‌خواهیم میانگین سن را برای خانم‌ها و آقایان حساب کنیم. و یا می‌خواهیم میانگین آلودگی هر ایالت را در هر روز پیدا کنیم.
<br>
        برای این کار، می‌توانیم از دستور <code>groupby</code> به شکل زیر استفاده کنیم.
</font>
</div>

In [59]:
df.groupby('Gender').mean()

              Age
Gender
Female  19.000000
Male    24.333333

In [60]:
aqi_data.groupby(['State Name', 'Date']).AQI.mean()

State Name  Date
Alabama     2018-01-01    35.111111
            2018-01-02    34.250000
            2018-01-03    32.555556
            2018-01-04    31.333333
            2018-01-05    39.687500
                            ...
Wyoming     2018-12-27    33.000000
            2018-12-28    31.111111
            2018-12-29    38.647059
            2018-12-30    34.823529
            2018-12-31    35.000000
Name: AQI, Length: 19525, dtype: float64

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
در مثال اول، ابتدا کل داده‌ها را بر اساس مقادیر مختلفی که در ستون Gender هست(یعنی Male و Female) به دو گروه تقسیم می‌کند. سپس برای هر گروه میانگین ستون‌های عددی را حساب می‌کند.
<br>
در مثال دوم، ابتدا کل داده‌ها بر اساس مقادیر مختلف ستون‌های State Name و Date تقسیم‌بندی می‌شوند. یعنی داده‌هایی که مربوط به هر ایالت و روز خاص هستند، در یک گروه خاص قرار می‌گیرند. سپس برای هر گروه،، میانگین AQI حساب می‌شود.
<br>
        برای دیدن اندازه هر گروه، می‌توانیم از دستور <code>size</code> استفاده کنیم.
</font>
</div>

In [61]:
df.groupby('Gender').size()

Gender
Female    1
Male      3
dtype: int64

<br>
<div id="sec_add_remove" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
اضافه‌کردن و حذف ستون
        </font>
		<p></p>
		<hr>
 خیلی اوقات در تحلیل داده، نیاز داریم تا ستونی جدید از روی داده‌های موجود بسازیم. مثلا فرض کنید می‌خواهیم ستونی جدید به aqi_data به نام Normal AQI اضافه کنیم و آن را از این رابطه به دست بیاوریم:
<br>
$$ NormalAQI = \frac{AQI}{MaxAQI}$$
        
<br>
که در آن Max AQI بیشترین مقدار AQI کل داده است. این ستون عملا کل داده‌های AQI را به عددی بین صفر و یک نگاشت می‌کند.
<br>
برای اضافه‌کردن این ستون می‌توانیم از دستور زیر استفاده کنیم:
</font>
</div>

In [62]:
aqi_data['Normal AQI'] = aqi_data['AQI'] / aqi_data.AQI.max()
aqi_data

,State Name,county Name,Date,AQI,Category,Defining Parameter,Normal AQI
0,Alabama,Baldwin,2018-01-02,32,Good,PM2.5,0.032129
1,Alabama,Baldwin,2018-01-05,34,Good,PM2.5,0.034137
2,Alabama,Baldwin,2018-01-08,15,Good,PM2.5,0.015060
3,Alabama,Baldwin,2018-01-11,19,Good,PM2.5,0.019076
4,Alabama,Baldwin,2018-01-14,25,Good,PM2.5,0.025100
...,...,...,...,...,...,...,...
341935,Wyoming,Weston,2018-12-27,36,Good,Ozone,0.036145
341936,Wyoming,Weston,2018-12-28,35,Good,Ozone,0.035141
341937,Wyoming,Weston,2018-12-29,35,Good,Ozone,0.035141
341938,Wyoming,Weston,2018-12-30,31,Good,Ozone,0.031124
341939,Wyoming,Weston,2018-12-31,35,Good,Ozone,0.035141

<div id="sec_whatisR" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
        این دستور باعث می‌شود که ستونی جدید اضافه شود و مقدار آن برای هر سطر از تقسیم مقدار AQI بر بیشینه کل AQIها حساب شود.
<br>
        هم‌چنین برای حذف یک ستون از داده می‌توانید از دستور <code>drop</code> به شکل زیر استفاده کنید.
</font>
</div>

In [63]:
aqi_data.drop(columns = ['State Name','Defining Parameter'])

       county Name        Date  AQI Category  Normal AQI
0          Baldwin  2018-01-02   32     Good    0.032129
1          Baldwin  2018-01-05   34     Good    0.034137
2          Baldwin  2018-01-08   15     Good    0.015060
3          Baldwin  2018-01-11   19     Good    0.019076
4          Baldwin  2018-01-14   25     Good    0.025100
...            ...         ...  ...      ...         ...
341935      Weston  2018-12-27   36     Good    0.036145
341936      Weston  2018-12-28   35     Good    0.035141
341937      Weston  2018-12-29   35     Good    0.035141
341938      Weston  2018-12-30   31     Good    0.031124
341939      Weston  2018-12-31   35     Good    0.035141

[341940 rows x 5 columns]

<br>
<div id="sec_additional" style="direction:rtl;line-height:300%;">
	<font face="XB Zar" size=4>
		<font color=#33ff49 size=6>
مطالعه بیشتر
        </font>
		<p></p>
		<hr>
        کتاب‌خانه pandas ، قابلیت‌های متعددی دارد که در این آموزش به خلاصه‌ای از آن پرداختیم. برای دیدن مستندات کامل pandas ، می‌توانید از 
        <a href="https://pandas.pydata.org/pandas-docs/stable/index.html">این</a>
        پیوند استفاده کنید. هم‌چنین در 
        <a href="https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html">        این</a>
و 
     <a href="http://jalammar.github.io/gentle-visual-intro-to-data-analysis-python-pandas/">این</a>
پیوند نیز آموزش‌های مقدماتی خوبی برای pandas وجود دارد.
<br>
برای دانلود برگه تقلب مربوط به pandas نیز می‌توانید از 
        <a href="https://quera.ir/qbox/download/uAEvNDAP8B/Pandas_Cheat_Sheet.pdf">این</a>
        پیوند استفاده کنید.(
        <a href="http://pandas.pydata.org/">منبع</a>
        )
</font>
</div>